class User < ApplicationRecord
  # Include default devise modules. Others available are:
  # :confirmable, :lockable, :timeoutable, :trackable and :omniauthable
  devise :database_authenticatable, :registerable,
         :recoverable, :rememberable, :validatable

  has_many :items
  has_one :address
  has_one :creditcard
  has_many :deals
  has_many :likes
  has_many :messages
  has_many :comments

  validates :nickname, :first_name, :family_name, :first_name_kana, :family_name_kana, :birth_year, :birth_month, :birth_day, presence: true
  validates :email, uniqueness: true

  enum birth_year: {
    "1901年": 1, "1902年": 2, "1903年": 3, "1904年": 4, "1905年": 5,
    "1906年": 6, "1907年": 7, "1908年": 8, "1909年": 9, "1910年": 10,
    "1911年": 11, "1912年": 12, "1913年": 13, "1914年": 14, "1915年": 15,
    "1916年": 16, "1917年": 17, "1918年": 18, "1919年": 19, "1920年": 20,
    "1921年": 21, "1922年": 22, "1923年": 23, "1924年": 24, "1925年": 25,
    "1926年": 26, "1927年": 27, "1928年": 28, "1929年": 29, "1930年": 30,
    "1931年": 31, "1932年": 32, "1933年": 33, "1934年": 34, "1935年": 35,
    "1936年": 36, "1937年": 37, "1938年": 38, "1939年": 39, "1940年": 40,
    "1941年": 41, "1942年": 42, "1943年": 43, "1944年": 44, "1945年": 45,
    "1946年": 46, "1947年": 47, "1948年": 48, "1949年": 49, "1950年": 50,
    "1951年": 51, "1952年": 52, "1953年": 53, "1954年": 44, "1955年": 45,
    "1956年": 46, "1957年": 47, "1958年": 48, "1959年": 49, "1960年": 50,
    "1961年": 41, "1962年": 42, "1963年": 43, "1964年": 44, "1965年": 45,
    "1966年": 46, "1967年": 47, "1968年": 48, "1969年": 49, "1970年": 50,
    "1971年": 41, "1972年": 42, "1973年": 43, "1974年": 44, "1975年": 45,
    "1976年": 46, "1977年": 47, "1978年": 48, "1979年": 49, "1980年": 50,
    "1981年": 41, "1982年": 42, "1983年": 43, "1984年": 44, "1985年": 45,
    "1986年": 46, "1987年": 47, "1988年": 48, "1989年": 49, "1990年": 50,
    "1991年": 41, "1992年": 42, "1993年": 43, "1994年": 44, "1995年": 45,
    "1996年": 46, "1997年": 47, "1998年": 48, "1999年": 49, "2000年": 50,
  }, _prefix: true
  
  enum birth_month: {
    "1月": 1, "2月": 2, "3月": 3, "4月": 4, "5月": 5, "6月": 6,
    "7月": 7, "8月": 8, "9月": 9, "10月": 10, "11月": 11, "12月": 12
  }, _prefix: true

  enum birth_day: {
    "1日": 1, "2日": 2, "3日": 3, "4日": 4, "5日": 5,
    "6日": 6, "7日": 7, "8日": 8, "9日": 9, "10日": 10,
    "11日": 11, "12日": 12, "13日": 13, "14日": 14, "15日": 15,
    "16日": 16, "17日": 17, "18日": 18, "19日": 19, "20日": 20,
    "21日": 21, "22日": 22, "23日": 23, "24日": 24, "25日": 25,
    "26日": 26, "27日": 27, "28日": 28, "29日": 29, "30日": 30, "31日": 31,
  }, _prefix: true


end
